# -------------------------------------------------------------------------------------

# Вы можете использовать кортежи, чтобы обменять значения с помощью одного выражения
# без применения временной переменной:
# password = 'swordfish'
# icecream = 'tuttifrutti'
# print(password)
# print(icecream)
# password, icecream = icecream, password
# print(password)
# print(icecream)

# --------------------------------------------------------------------------------------

# Функция tuple создаёт кортежи из других объектов:
# marx_list = ['Groucho', 'Chico', 'Harpo']
# print(marx_list)
# tuple(marx_list)
# print(tuple(marx_list))

# --------------------------------------------------------------------------------------

# создание словаря с помощью {}
# bierce = {  # Имя словаря
#     "day": "A period of twenty-four hours, mostly misspent",  # "day" ключь словаря после идёт значение ключа
#     "positive": "Mistaken at the top of one's voice",
#     "misfortune": "The kind of fortune that never misses",
# }
# print(bierce)

# -------------------------------------------------------------------------------------------

# Преобразование с помощью функции dict()
# Вы можете использовать функцию dict(), чтобы преобразовывать последовательности из двух значений словаря.
# lol = [['a', 'b'],['c', 'd'], ['e', 'f']]
# dict(lol)
# print(dict(lol))

# Рассмотрим другие примеры:
# Список содержащий двухэлементный кортежи:
# lot = [('a', 'b'), ('c', 'd'), ('e', 'f')]
# dict(lot)
# print(dict(lot))

# Кортеж, включающий двухэлементные строки:
# tol = (['a', 'b'], ['c', 'd'], ['e', 'f'])
# dict(tol)
# print(dict(tol))
#
# Список, содержащий двухсимвольные строки:
# los = ['ab', 'cd', 'ef']
# dict(los)
# print(dict(los))

# Кортеж содержащий двухсимвольные строки:
# tos = ('ab', 'cd', 'ef')
# dict(tos)
# print(dict(tos))

# ---------------------------------------------------------------------------------------------

# Добавление или изменение элемента с помощью конструкции [ключ]
# pythons = {
#     'Chapman': 'John',
#     'Cleese': 'John',
#     'Idle': 'Eric',
#     'Jones': 'Terry',
#     'Palin': 'Michael',
# }
# pythons['Gilliam'] = 'Gerry'  # добавление одного участника
# print(pythons)
#
# pythons['Gilliam'] = 'Terry'  # Исправление участника. Помните что ключи должны быть уникальные.
# print(pythons)

# -----------------------------------------------------------------------------------------------

# Объединение словарей с помощью функции update()
# Вы можете использовать функцию update(), чтобы скопировать ключи и значения из одного словаря в другой.
# Определим словарь python, содержащий имена всех участников:
# pythons = {
#     'Chapman': 'Graham',
#     'Cleese': 'John',
#     'Gilliam': 'Terry',
#     'Idle': 'Eric',
#     'Jones': 'Terry',
#     'Palin': 'Michael',
# }
# print(pythons)

# Кроме того у нас есть другой словарь, содержащий имена других юмористов и называется others:
# others = {'Marx': 'Groucho', 'Howard': 'Moe'}
# Теперь появляется ещё один анонимный программист, который считает, что члены словаря others должны быть членами
# Monty Python:
# pythons.update(others)
# print(pythons)

# Что произойдёт, если во втором словаре будет находится такие же ключи, что и в первом?
# Победит значение из второго словаря:
# first = {'a': '1', 'b': '2'}
# print(first)
# second = {'b': 'platypus'}
# first.update(second)
# print(first)

# --------------------------------------------------------------------------------------------------------------------

# Удаление элементов по их ключу с помощью del
