# Эта глава посвящена функциям — именованным блокам кода, предназначенным
# для решения одной конкретной задачи. Чтобы выполнить задачу, определенную
# в виде функции, вы указываете имя функции, отвечающей за эту задачу. Если зада-
# ча должна многократно выполняться в программе, вам не придется заново вводить
# весь необходимый код; просто вызовите функцию, предназначенную для решения
# задачи, и этот вызов приказывает Python выполнить код, содержащийся внутри
# функции. Как вы вскоре убедитесь, использование функций упрощает чтение, на-
# писание, тестирование кода и исправление ошибок.
# В этой главе также рассматриваются возможности передачи информации функ-
# циям. Вы узнаете, как писать функции, основной задачей которых является вывод
# информации, и другие функции, предназначенные для обработки данных и возвра-
# щения значения (или набора значений.) Наконец, вы научитесь хранить функции
# в отдельных файлах, называемых модулями, для упорядочения файлов основной
# программы.

# ---------------------------------------------------------------------------------------------------------------------

# Определение функции

def greet_user():  # 1) def сообщает python что вы определяете функцию
    """Выводит простое приветсвие."""  # 2) представляет собой коментарий - строку документации
    print("Hello!")


greet_user()
