# ОПРЕДЕЛЕНИЕ КОРТЕЖА:

# dimension = (200, 50)
# print(dimension[0])
# print(dimension[1])

# Посмотрим что произойдёт при попытке изменения одного их элементов в кортеже dimension

# dimension = (200, 50)
# dimension[0] = 250
# Выводится ошибка ==> объект 'кортеж' не поддерживает назначение элементов

# --------------------------------------------------------------------------------------------------------

# ПЕРЕВОД ВСЕХ ЗНАЧЕНИЙ В КОРТЕЖЕ:

# dimensions = (200, 50)
# for dimension in dimensions:
#     print(dimension)

# -----------------------------------------------------------------------------------------------------

# Замена кортежа:
# Элементы кортежа не могут изменяться, но вы можете присвоить новое значение
# переменной, в которой хранится кортеж. Таким образом, для изменения размеров
# прямоугольника следует переопределить весь кортеж:

# dimensions = (200, 50)
# print('Original dimensions:')
# for dimension in dimensions:
#     print(dimension)
#
# dimensions = (400, 100)
# print('\nModified dimensions:')
# for dimension in dimensions:
#     print(dimension)
#
# ----------------------------------------------------------------------------------------------------------

# Упражнение
# 4-13.
# Шведский стол: меню «шведского стола» в ресторане состоит всего из пяти пунктов.
# Придумайте пять простых блюд и сохраните их в кортеже.
# • Используйте цикл for для вывода всех блюд, предлагаемых рестораном.
# • Попробуйте изменить один из элементов и убедитесь в том, что Python отказывается
# вносить изменения.
# • Ресторан изменяет меню, заменяя два элемента другими блюдами. Добавьте блок
# кода, который заменяет кортеж, и используйте цикл for для вывода каждого элемента
# обновленного меню.

buffets = ('Бекон жареный', 'Сосиски молочные/охотничьи', 'Омлет Яйцо в смятку', 'Каша рисовая', 'Сервелат')
print('Основное меню:')
for buffet in buffets:
    print(buffet)

# buffets[0] = ('Мясо') # Выводится ошибка ==> объект 'кортеж' не поддерживает назначение элементов

buffets = ('Чай', 'Курица', 'Омлет Яйцо в смятку', 'Каша рисовая', 'Сервелат')
print('\nНовое меню:')
for buffet in buffets:
    print(buffet)
