# Использование API веб-приложений
#
# API веб-приложения представляет собой часть веб-сайта, предназначенную для
# взаимодействия с программами, которые используют особым образом построенные
# URL-адреса для запроса информации. Подобные запросы называются вызовами
# API. Запрашиваемые данные возвращаются в удобном формате (например, JSON
# или CSV). Многие приложения, зависящие от внешних источников данных (как
# приложения, интегрирующиеся с сайтами социальных сетей), используют вызовы
# API.

# -------------------------------------------------------------------------------------------------------------------

