# Ведение счета

# В этой главе построение игры Alien Invasion будет завершено. Мы добавим
# кнопку Play для запуска игры по желанию игрока или перезапуска игры после
# ее завершения. Мы также изменим игру, чтобы она ускорялась при переходе
# игрока на следующий уровень, и реализуем систему подсчета очков. К концу
# главы вы будете знать достаточно, чтобы заняться разработкой игр, сложность
# которых нарастает по ходу игры и в которых реализована система подсчета
# очков.

# -------------------------------------------------------------------------------------------------------------------

# Добавление кнопки Play

# В этом разделе мы добавим кнопку Play, которая отображается перед началом игры
# и появляется после ее завершения, чтобы игрок мог сыграть снова.
# В текущей версии игра начинается сразу же после запуска alien_invasion.py. После
# очередных изменений игра будет запускаться в неактивном состоянии и предла-
# гать игроку нажать кнопку Play для запуска. Для этого включите следующий код
# в game_stats.py:

# game_stats.py
#
# def __init__(self, ai_settings):
# """Инициализирует статистику."""
# self.ai_settings = ai_settings
# self.reset_stats()
# # Игра запускается в неактивном состоянии.
# self.game_active = False
# def reset_stats(self):
# ...
#
# Итак, программа запускается в неактивном состоянии, а игру можно запустить
# только нажатием кнопки Play.

# --------------------------------------------------------------------------------------------------------------------